Loading the required libraries

In [1]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

Loading the datasets

In [2]:
ord_df = pd.read_csv(r'order_lines.csv')
uom_df = pd.read_csv(r'uom_conversions.csv')
dist_df = pd.read_csv(r'Distances.csv')
gps_df = pd.read_csv(r'Gps_locations.csv')

Pre-processing Orders data

In [3]:
ord_df.shape

(5208, 10)

In [4]:
ord_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5208 entries, 0 to 5207
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         5208 non-null   int64
 1   Date               5208 non-null   object
 2   Month-Year         5208 non-null   object
 3   Warehouse Code     5208 non-null   int64
 4   Customer Code      5208 non-null   object
 5   Order Number       5208 non-null   int64
 6   Order Line Number  5208 non-null   int64
 7   Item Code          5208 non-null   object
 8   Units              5208 non-null   float64
 9   Euros              5208 non-null   float64
dtypes: float64(2), int64(4), object(4)
memory usage: 407.0+ KB

In [5]:
ord_df.head(5)

,Unnamed: 0,Date,Month-Year,Warehouse Code,Customer Code,Order Number,Order Line Number,Item Code,Units,Euros
0,112,2021-01-04 00:00:00.000,1-2021,3403434,5002915-15,20247100,1,963543-43,2.0,381.47
1,14485,2021-01-07 00:00:00.000,1-2021,3403434,5397843-43,20258239,1,8902753-53,250.0,187.03
2,14486,2021-01-07 00:00:00.000,1-2021,3403434,5397843-43,20258239,2,8308591-91,500.0,452.45
3,14487,2021-01-07 00:00:00.000,1-2021,3403434,5397843-43,20258239,3,8308621-21,500.0,452.45
4,14488,2021-01-07 00:00:00.000,1-2021,3403434,5397843-43,20258239,4,8022921-21,400.0,567.16

In [6]:
ord_df.isnull().sum()

Unnamed: 0           0
Date                 0
Month-Year           0
Warehouse Code       0
Customer Code        0
Order Number         0
Order Line Number    0
Item Code            0
Units                0
Euros                0
dtype: int64

In [7]:
ord_df.duplicated().sum()

0

In [8]:
# Dropping duplicates
ord_df = ord_df.drop_duplicates()
ord_df.duplicated().sum()

0

In [9]:
# Convert Date column to datetime
ord_df['Date'] = pd.to_datetime(ord_df['Date'], errors='coerce')

In [10]:
# Drop unnecessary column
ord_df=ord_df.drop(columns=['Unnamed: 0'])

In [11]:
ord_df.head(5)

,Date,Month-Year,Warehouse Code,Customer Code,Order Number,Order Line Number,Item Code,Units,Euros
0,2021-01-04,1-2021,3403434,5002915-15,20247100,1,963543-43,2.0,381.47
1,2021-01-07,1-2021,3403434,5397843-43,20258239,1,8902753-53,250.0,187.03
2,2021-01-07,1-2021,3403434,5397843-43,20258239,2,8308591-91,500.0,452.45
3,2021-01-07,1-2021,3403434,5397843-43,20258239,3,8308621-21,500.0,452.45
4,2021-01-07,1-2021,3403434,5397843-43,20258239,4,8022921-21,400.0,567.16

Pre-processing Unit of Measure Conversions data

In [12]:
uom_df.shape

(557, 3)

In [13]:
uom_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 557 entries, 0 to 556
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        557 non-null    int64
 1   Item Code         557 non-null    object
 2   Conversion Ratio  557 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 13.2+ KB

In [14]:
uom_df.head(5)

   Unnamed: 0   Item Code  Conversion Ratio
0          51   995097-97            0.0242
1         100   995096-96            0.0242
2         113  8949591-91            0.0474
3         131   952547-47            0.0368
4         276   866370-70            0.0400

In [15]:
uom_df.isnull().sum()

Unnamed: 0          0
Item Code           0
Conversion Ratio    0
dtype: int64

In [16]:
uom_df.duplicated().sum()

0

In [17]:
# Drop unnecessary column
uom_df=uom_df.drop(columns=['Unnamed: 0'])

In [18]:
uom_df.head(5)

    Item Code  Conversion Ratio
0   995097-97            0.0242
1   995096-96            0.0242
2  8949591-91            0.0474
3   952547-47            0.0368
4   866370-70            0.0400

Pre-processing Mode of Transport data

In [19]:
dist_df.shape

(19, 13)

In [20]:
dist_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         19 non-null     int64
 1   Warehouse Code     19 non-null     int64
 2   Warehouse Name     19 non-null     object
 3   Warehouse Country  19 non-null     object
 4   Warehouse City     19 non-null     object
 5   Customer Code      19 non-null     object
 6   Customer City      19 non-null     object
 7   Customer Country   19 non-null     object
 8   Road               19 non-null     float64
 9   Rail               19 non-null     int64
 10  Sea                19 non-null     int64
 11  Air                19 non-null     int64
 12  total_dist         19 non-null     float64
dtypes: float64(2), int64(5), object(6)
memory usage: 2.1+ KB

In [21]:
dist_df.isnull().sum()

Unnamed: 0           0
Warehouse Code       0
Warehouse Name       0
Warehouse Country    0
Warehouse City       0
Customer Code        0
Customer City        0
Customer Country     0
Road                 0
Rail                 0
Sea                  0
Air                  0
total_dist           0
dtype: int64

In [22]:
dist_df.duplicated().sum()

0

In [23]:
# Feature Engineering: Creating a new 'Location' column by combining 'Customer City' and 'Customer Country'
dist_df['Location'] = dist_df['Customer City'].astype(str) + ', ' + dist_df['Customer Country'].astype(str)
dist_df['Location'] = dist_df['Location'].str.strip()

In [24]:
coordinates = {
    'CHALONS-EN-CHAMPAGNE': (48.9575, 4.3650),
    'MONTMIRAIL': (48.8702, 3.5371)
}

# Create a new column with coordinates based on the city names
dist_df['Coordinates'] = dist_df['Warehouse City'].map(coordinates)

# Split the 'Coordinates' column into two new columns
dist_df[['Warehouse_Latitude', 'Warehouse_Longitude']] = pd.DataFrame(dist_df['Coordinates'].tolist(), index=dist_df.index)

# Drop the original 'Coordinates' column if you no longer need it
dist_df.drop(columns=['Coordinates'], inplace=True)

In [25]:
dist_df.head(5)

,Unnamed: 0,Warehouse Code,Warehouse Name,Warehouse Country,Warehouse City,Customer Code,Customer City,Customer Country,Road,Rail,Sea,Air,total_dist,Location,Warehouse_Latitude,Warehouse_Longitude
0,19,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,5002915-15,Lisbon,Portugal,765.728,0,0,660,1425.728,"Lisbon, Portugal",48.9575,4.365
1,610,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,5397843-43,Barcelona,Spain,281.488,0,0,951,1232.488,"Barcelona, Spain",48.9575,4.365
2,676,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,5340669-69,Ålesund,Norway,856.000,0,1154,0,2010.000,"Ålesund, Norway",48.9575,4.365
3,682,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,5340672-72,Stavanger,Norway,82.694,0,1296,0,1378.694,"Stavanger, Norway",48.9575,4.365
4,1375,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,5029913-13,San Marino,Italy,288.437,0,0,908,1196.437,"San Marino, Italy",48.9575,4.365

In [26]:
# Drop unnecessary columns
dist_df=dist_df.drop(columns=['Unnamed: 0','Customer City','Customer Country'])

In [27]:
dist_df

,Warehouse Code,Warehouse Name,Warehouse Country,Warehouse City,Customer Code,Road,Rail,Sea,Air,total_dist,Location,Warehouse_Latitude,Warehouse_Longitude
0,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,5002915-15,765.728,0,0,660,1425.728,"Lisbon, Portugal",48.9575,4.3650
1,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,5397843-43,281.488,0,0,951,1232.488,"Barcelona, Spain",48.9575,4.3650
2,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,5340669-69,856.000,0,1154,0,2010.000,"Ålesund, Norway",48.9575,4.3650
3,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,5340672-72,82.694,0,1296,0,1378.694,"Stavanger, Norway",48.9575,4.3650
4,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,5029913-13,288.437,0,0,908,1196.437,"San Marino, Italy",48.9575,4.3650
5,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,5003451-51,295.165,0,0,874,1169.165,"Bratislava, Slovakia",48.9575,4.3650
6,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,5293132-32,353.590,0,0,840,1193.590,"Vienna, Austria",48.9575,4.3650
7,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,5003269-69,478.723,0,0,777,1255.723,"Ostrava, Czech Republic",48.9575,4.3650
8,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,5003474-74,287.110,0,0,856,1143.110,"Budapest, Hungary",48.9575,4.3650
9,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,5003476-76,84.851,0,0,341,425.851,"Amsterdam, Netherlands",48.9575,4.3650
10,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,115-15,293.858,0,0,871,1164.858,"Glasgow, United Kingdom",48.9575,4.3650
11,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,5006517-17,256.250,0,0,671,927.250,"Berlin, Germany",48.9575,4.3650
12,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,5335348-48,626.000,0,1165,0,1791.000,"Tampere, Finland",48.9575,4.3650
13,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,9001746-46,357.151,0,1060,0,1417.151,"Dublin, Ireland",48.9575,4.3650
14,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,9066250-50,667.613,0,1295,0,1962.613,"Stockholm, Sweden",48.9575,4.3650
15,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,5334855-55,409.000,671,44,0,1124.000,"Edinburgh, United Kingdom",48.9575,4.3650
16,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,5494889-89,268.336,0,1200,0,1468.336,"Cork, Ireland",48.9575,4.3650
17,3403434,WAREHOUSE PARIS AREA 1,FRANCE,CHALONS-EN-CHAMPAGNE,5262267-67,300.000,0,3739,995,5034.000,"Boston, USA",48.9575,4.3650
18,3402002,WAREHOUSE PARIS AREA 2,FRANCE,MONTMIRAIL,5486697-97,2163.000,0,1420,0,3583.000,"Athens, Greece",48.8702,3.5371

Pre-processing GPS data

In [28]:
gps_df.shape

(19, 4)

In [29]:
gps_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  19 non-null     int64
 1   Location    19 non-null     object
 2   Latitude    19 non-null     float64
 3   Longitude   19 non-null     float64
dtypes: float64(2), int64(1), object(1)
memory usage: 736.0+ bytes

In [30]:
gps_df.isnull().sum()

Unnamed: 0    0
Location      0
Latitude      0
Longitude     0
dtype: int64

In [31]:
gps_df.duplicated().sum()

0

In [32]:
gps_df['Location'] = gps_df['Location'].str.strip()

In [33]:
# Drop unnecessary column
gps_df=gps_df.drop(columns=['Unnamed: 0'])

In [34]:
gps_df.head()

            Location  Latitude  Longitude
0   Lisbon, Portugal   38.7167    -9.1390
1   Barcelona, Spain   41.3851     2.1734
2    Ålesund, Norway   62.4722     6.1495
3  Stavanger, Norway   58.9701     5.7333
4  San Marino, Italy   43.9429    12.4578

Final Dataset: Merging Orders Data, Unit of Measure Data, Distances Data, and GPS Data to create a comprehensive dataset that enhances insights into orders by associating items with unit conversions, providing location-based distance information, and enriching order details with GPS coordinates.

In [35]:
# Merge Orders Data with Unit of Measure Data on 'Item Code'
ord_df_join = pd.merge(ord_df.copy(), uom_df, on='Item Code', how='left').drop(columns=ord_df.filter(regex='_y$').columns.tolist())

# Merge Distances Data with GPS Data on 'Location'
dist_df = pd.merge(dist_df, gps_df, on='Location', how='left').drop(columns=dist_df.filter(regex='_y$').columns.tolist())

# Merge the resulting Orders Data with Distances Data on 'Warehouse Code' and 'Customer Code'
ord_df_join = pd.merge(ord_df_join, dist_df, on=['Warehouse Code', 'Customer Code'], how='left').drop(columns=ord_df_join.filter(regex='_y$').columns.tolist())

In [36]:
ord_df_join.shape

(5208, 23)

Feature Engineering

In [37]:
# Creating a new 'Weight (KG)' column

ord_df_join['KG']=ord_df_join['Units']*ord_df_join['Conversion Ratio']

In [38]:
# Creating CO2 emission columns for each mode using emissions factors

dict_co2e = dict(zip(['Air' ,'Sea', 'Road', 'Rail'], [2.1, 0.01, 0.096, 0.028]))
MODES = ['Road', 'Rail','Sea', 'Air']
for mode in MODES:
    ord_df_join['CO2 ' + mode] = ord_df_join['KG'].astype(float)/1000 * ord_df_join[mode].astype(float) * dict_co2e[mode]
ord_df_join['CO2 Total'] = ord_df_join[['CO2 ' + mode for mode in MODES]].sum(axis = 1)

In [39]:
ord_df_join.head(5)

,Date,Month-Year,Warehouse Code,Customer Code,Order Number,Order Line Number,Item Code,Units,Euros,Conversion Ratio,...,Warehouse_Latitude,Warehouse_Longitude,Latitude,Longitude,KG,CO2 Road,CO2 Rail,CO2 Sea,CO2 Air,CO2 Total
0,2021-01-04,1-2021,3403434,5002915-15,20247100,1,963543-43,2.0,381.47,56.58400,...,48.9575,4.365,38.7167,-9.1390,113.168,8.318967,0.0,0.0,156.850848,165.169815
1,2021-01-07,1-2021,3403434,5397843-43,20258239,1,8902753-53,250.0,187.03,0.03200,...,48.9575,4.365,41.3851,2.1734,8.000,0.216183,0.0,0.0,15.976800,16.192983
2,2021-01-07,1-2021,3403434,5397843-43,20258239,2,8308591-91,500.0,452.45,0.02219,...,48.9575,4.365,41.3851,2.1734,11.095,0.299818,0.0,0.0,22.157825,22.457643
3,2021-01-07,1-2021,3403434,5397843-43,20258239,3,8308621-21,500.0,452.45,0.02219,...,48.9575,4.365,41.3851,2.1734,11.095,0.299818,0.0,0.0,22.157825,22.457643
4,2021-01-07,1-2021,3403434,5397843-43,20258239,4,8022921-21,400.0,567.16,0.03200,...,48.9575,4.365,41.3851,2.1734,12.800,0.345892,0.0,0.0,25.562880,25.908772

In [40]:
ord_df_join.to_csv(r'final_dataset.csv', index=False)